## data_examples_app.R ##

################################################
# Modelo de proporção
################################################
df_prop = data.frame(Studies = c("Study 1",
                               "Study 2",
                               "Study 3",
                               "Study 4"),
                     events = c(17, 23, 6, 106),
                     n = c(30, 50, 30, 189))

################################################
# Modelo de diferença de médias 
################################################
df_medp = data.frame(Studies = c("Study 1",
                               "Study 2",
                               "Study 3",
                               "Study 4"),
                     n.e = c(30, 23, 83, 21),
                     mean.e = c(51.57, 75.09, 30.08, 2.95),
                     sd.e = c(16.5, 23.01, 14.29, 1.28),
                     n.c = c(30, 24, 81, 21),
                     mean.c = c(72.97, 81.63, 35.38, 3.48),
                     sd.c = c(13.23, 14.42, 16.13, 0.68))

################################################
# Modelo de correlação
################################################
df_corr = data.frame(Studies = c("Study 1",
                               "Study 2",
                               "Study 3",
                               "Study 4"),
                     n = c(351, 163, 328, 1718),
                     r = c(0.01, 0.4, 0.162, 0.225))

################################################
# Modelos dicotômicos RR, RD ou OR
################################################
df_dich = data.frame(Studies = c("Study 1",
                               "Study 2",
                               "Study 3",
                               "Study 4"),
                   event.e = c(0, 0, 15, 8),
                   n.e = c(9, 10, 54, 27),
                   event.c = c(8, 10, 51, 27),
                   n.c = c(9, 10, 54, 27))
